## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_pet.aoai will be created
  + resource "random_pet" "aoai" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "gmcoac"
        # (1 unchanged attribute hidden)
    }

  # random_pet.rg_name will be created
  + resource "random_pet" "rg_name" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "rg"
      + separator = "-"
    }

  # random_pet.search will be created
  + resource "random_pet" "search" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "gmaise"
        # (1 unchanged attribute hidden)
    }

  # module.azure_cognitive_account.azurerm_cognitive_account.aoai_account will be created
  + resource "azurerm_cognitive_account" "aoai_account" {
      + custom_subdomain_name              = (known after apply)
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = true
      + location                           = "eastus2"
      + name                               = (known after apply)
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = (known after apply)
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
    }

  # module.azure_openai_deployment_embedding.azurerm_cognitive_deployment.aoai_deployment will be created
  + resource "azurerm_cognitive_deployment" "aoai_deployment" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "text-embedding-3-small"
      + rai_policy_name        = "Microsoft.DefaultV2"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "text-embedding-3-small"
            # (1 unchanged attribute hidden)
        }

      + sku {
          + capacity = 8
          + name     = "Standard"
        }
    }

  # module.azure_openai_deployment_gpt.azurerm_cognitive_deployment.aoai_deployment will be created
  + resource "azurerm_cognitive_deployment" "aoai_deployment" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gpt-4o-mini"
      + rai_policy_name        = "Microsoft.DefaultV2"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4o-mini"
          + version = "2024-07-18"
        }

      + sku {
          + capacity = 8
          + name     = "Standard"
        }
    }

  # module.azurerm_search_service.azurerm_search_service.search_service will be created
  + resource "azurerm_search_service" "search_service" {
      + customer_managed_key_encryption_compliance_status = (known after apply)
      + customer_managed_key_enforcement_enabled          = false
      + hosting_mode                                      = "default"
      + id                                                = (known after apply)
      + local_authentication_enabled                      = true
      + location                                          = "eastus2"
      + name                                              = (known after apply)
      + network_rule_bypass_option                        = "None"
      + partition_count                                   = 1
      + primary_key                                       = (sensitive value)
      + public_network_access_enabled                     = true
      + query_keys                                        = (known after apply)
      + replica_count                                     = 1
      + resource_group_name                               = (known after apply)
      + secondary_key                                     = (sensitive value)
      + sku                                               = "free"
    }

  # module.resource_group.azurerm_resource_group.resource_group will be created
  + resource "azurerm_resource_group" "resource_group" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>